In [1]:
#pandas=>

In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\hp\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\hp\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [5]:
import pandas as pd

In [7]:
 #data structure of pandas
#(1)series
#(2)dataframe

In [9]:
#(1)Series=>it is one dimensional array and it returns only values not column name
a=pd.Series([1,34,67,90])
a

0     1
1    34
2    67
3    90
dtype: int64

In [11]:
type(a)

pandas.core.series.Series

In [13]:
#(2)DataFrame=>it is multi dimensional array and it returns values with column name
a={
    "emp_id":[1,2,3,4,5],
    "name":['sam','raj','poonam','khushi','pooja'],
    "department":["IT","sales","IT","IT","IT"],
    "working_hours":[8,8,9,7,8],
    "salary":[25000,27000,31000,36000,50000]
}

In [15]:
type(a)

dict

In [17]:
df=pd.DataFrame(a)

In [19]:
a

{'emp_id': [1, 2, 3, 4, 5],
 'name': ['sam', 'raj', 'poonam', 'khushi', 'pooja'],
 'department': ['IT', 'sales', 'IT', 'IT', 'IT'],
 'working_hours': [8, 8, 9, 7, 8],
 'salary': [25000, 27000, 31000, 36000, 50000]}

In [21]:
df

   emp_id    name department  working_hours  salary
0       1     sam         IT              8   25000
1       2     raj      sales              8   27000
2       3  poonam         IT              9   31000
3       4  khushi         IT              7   36000
4       5   pooja         IT              8   50000

In [29]:
#how can we import or export our dataframe?
#for export=>
df.to_csv("C:\\Users\\hp\\Desktop\\poonam\\Emp_Info.csv",index=False)

In [33]:
#for import=>(csv=comma separated value)
df2=pd.read_csv("C:\\Users\\hp\\Desktop\\poonam\\Emp_Info.csv")

In [35]:
df2

   emp_id    name department  working_hours  salary
0       1     sam         IT              8   25000
1       2     raj      sales              8   27000
2       3  poonam         IT              9   31000
3       4  khushi         IT              7   36000
4       5   pooja         IT              8   50000

In [37]:
#if we want to save our data in excel=>
df.to_excel("C:\\Users\\hp\\Desktop\\poonam\\updated_id.xlsx")

In [39]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\hp\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\hp\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [41]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\hp\anaconda3\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\hp\anaconda3\lib\site-packages (from openpyxl) (1.1.0)

In [ ]:
#Q.=>create a dataframe =>students(id,name,roll number,section,batch,domain)--->10 rows creating--->
#csv import and export 
#in jupyter and colab both